import type { Group } from '../types/group';

export const myGroup: Group[] = [
  {
    subgroup: 1,
    students: [
      'Чугай А.Д. (Староста)',
      'Бондарев Д.А.',
      'Веренич А.С.',
      'Гладков К.А.',
      'Гришаев А.А.',
      'Гусейнов Р.Ш.',
      'Даниленко С.В.',
      'Замятнин В.И.',
      'Зиа М.К.',
      'Каримбаев С.К.',
      'Мередов Р.Н.',
      'Непесов Г.А.',
    ],
  },
  {
    subgroup: 2,
    students: [
      'Каржавина А.М. (Зам. старосты)',
      'Захарченко П.М.',
      'Лавренюк К.А.',
      'Ляхов И.В.',
      'Манышев Р.А.',
      'Матвейчиков М.В.',
      'Новиков Д.А.',
      'Понтелеенко С.В.',
      'Чуешов Н.С.',
      'Розметов Х.А.',
      'Халыев М.Д.',
      'Якубов А.К.',
    ],
  },
];
