import type { Schedule } from '../types/schedule';

export const schedule: Schedule[] = [
  {
    day: 'Понедельник',
    time: ['9:00-10:35', '10:45-12:20', '12:40-14:15', '14:35-16:10'],
    subjects: [
      { subject: ['Дифференциальные и интегральные уравнения (лк) 4-14'] },
      { subject: ['Основы векторного и тензорного анализа (лк) 4-14'] },
      { subject: ['Иностранный язык 2-14'] },
      { subject: [''] },
    ],
  },
  {
    day: 'Вторник',
    time: ['9:00-10:35', '10:45-12:20', '12:40-14:15', '14:35-16:10'],
    subjects: [
      { subject: ['Программирование на С++ (лб) 2-16, 2-17', 'Основы Web-технологий (лаб) 6-3'] },
      { subject: ['Программирование на С++ (лб) 2-16, 2-17', 'Основы Web-технологий (лаб) 6-3'] },
      {
        subject: [
          'Программирование на С++ (лк) 2-10',
          'Основы векторного и тензорного анализа 2-10',
        ],
      },
      { subject: ['Дифференциальные и интегральные уравнения (пр) 2-10'] },
    ],
  },
  {
    day: 'Среда',
    time: ['9:00-10:35', '10:45-12:20', '12:40-14:15', '14:35-16:10'],
    subjects: [
      { subject: ['Физвоспитание'] },
      { subject: ['Философия (лк) 2-25'] },
      {
        subject: ['Политология (лк) 4-10', 'Политология (пр) 4-10'],
      },
      {
        subject: [
          'Дифференциальные и интегральные уравнения (пр) к 4 0-26',
          'Молекулярная физика (пр) 6-6',
        ],
      },
    ],
  },
  {
    day: 'Четверг',
    time: ['9:00-10:35', '10:45-12:20', '12:40-14:15', '14:35-16:10'],
    subjects: [
      { subject: ['Иностранный язык 2-10', 'Молекулярная физика (лк) 4-14'] },
      { subject: ['Основы векторного и тензорного анализа 3-1'] },
      {
        subject: ['Дифференциальные и интегральные уравнения (лк) 4-14', 'Философия (пр) 2-1'],
      },
      {
        subject: ['Молекулярная физика (пр) 2-10'],
      },
    ],
  },
  {
    day: 'Пятница',
    time: ['9:00-10:35', '10:45-12:20', '12:40-14:15', '14:35-16:10'],
    subjects: [
      { subject: ['Молекулярная физика (лк) 4-14'] },
      { subject: ['Физический практикум: молекулярная физика 5-22'] },
      { subject: ['Физический практикум: молекулярная физика 5-22'] },
      {
        subject: [''],
      },
    ],
  },
  {
    day: 'Суббота',
    time: ['9:00-10:35', '10:45-12:20', '12:40-14:15', '14:35-16:10'],
    subjects: [
      { subject: ['Физвоспитание'] },
      { subject: ['Великая  Отечественная война советского народа 2-25'] },
      { subject: [''] },
      {
        subject: [''],
      },
    ],
  },
];
